<a href="https://colab.research.google.com/github/Salma-Abouzeid/Pandas-Assignment/blob/main/Copy_of_Pandas_Questions.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# üêº Pandas Practice: DataFrames, Selection, Mapping, and More

In [131]:
import pandas as pd
import numpy as np

# Set seed for reproducibility
np.random.seed(42)

# Sample data
names = ['Alice', 'Bob', 'Charlie', 'Diana', 'Ethan', 'Fiona', 'George', 'Hannah']
departments = ['Sales', 'Marketing', 'HR', 'Tech']

# Create a DataFrame
df = pd.DataFrame({
    'Name': np.random.choice(names, size=20),
    'Age': np.random.randint(22, 60, size=20),
    'Department': np.random.choice(departments, size=20),
    'Salary': np.random.randint(40000, 120000, size=20),
    'YearsExperience': np.random.randint(0, 20, size=20)
})
df.head()

      Name  Age Department  Salary  YearsExperience
0   George   43         HR   75920               15
1    Diana   23  Marketing  107121               12
2    Ethan   45       Tech  109479               17
3   George   51      Sales   59457               14
4  Charlie   59       Tech  106557               12

# üß™ PRACTICE QUESTIONS BELOW


# 1Ô∏è‚É£ Use .loc to select all rows where the Department is 'Tech'.
#    - Describe what .loc does and why it's useful for label-based filtering.

In [77]:
import pandas as pd
import numpy as np

# Set seed for reproducibility
np.random.seed(42)

# Sample data
names = ['Alice', 'Bob', 'Charlie', 'Diana', 'Ethan', 'Fiona', 'George', 'Hannah']
departments = ['Sales', 'Marketing', 'HR', 'Tech']

# Create a DataFrame
df = pd.DataFrame({
    'Name': np.random.choice(names, size=20),
    'Age': np.random.randint(22, 60, size=20),
    'Department': np.random.choice(departments, size=20),
    'Salary': np.random.randint(40000, 120000, size=20),
    'YearsExperience': np.random.randint(0, 20, size=20)
})
print(df.loc[df['Department']=='Tech']) #loc is used to access certain rows and columns using indexes or conditions

       Name  Age Department  Salary  YearsExperience
2     Ethan   45       Tech  109479               17
4   Charlie   59       Tech  106557               12
12  Charlie   49       Tech  111211               11
13  Charlie   37       Tech  105697                7
15    Ethan   24       Tech   72606               18
17   Hannah   28       Tech   80397                7
19  Charlie   30       Tech   95591                2


# 2Ô∏è‚É£ Use .iloc to select the first 5 rows and the last two columns.
#    - What is the difference between .loc and .iloc?

In [25]:
print(df.iloc[:5,-2:]) #loc can use labels as arguments, while iloc uses indexes. In loc, slicing last elements is included, in iloc, it is not

   Salary  YearsExperience
0   75920               15
1  107121               12
2  109479               17
3   59457               14
4  106557               12


# 3Ô∏è‚É£ Map a new column called 'DeptCode' where:
#     'Sales' -> 1, 'Marketing' -> 2, 'HR' -> 3, 'Tech' -> 4.
#    - Use .map and explain what happens if a value is not mapped.

In [113]:
df['DeptCode']=df['Department'].map({'Sales':1,'Marketing':2,'HR':3,'Tech':4})
print(df)
#if a value is not mapped, its corresponding value in the new column becomes a null value

       Name  Age Department  Salary  YearsExperience  DeptCode
0    George   43         HR   75920               15         3
1     Diana   23  Marketing  107121               12         2
2     Ethan   45       Tech  109479               17         4
3    George   51      Sales   59457               14         1
4   Charlie   59       Tech  106557               12         4
5    Hannah   23  Marketing  117189                8         2
6     Ethan   42  Marketing  118953               14         2
7     Ethan   54  Marketing   92995               12         2
8    George   33      Sales   80757                0         1
9       Bob   43  Marketing   49692                6         2
10  Charlie   46      Sales   85758                8         1
11   George   48  Marketing  112409                0         2
12  Charlie   49       Tech  111211               11         4
13  Charlie   37       Tech  105697                7         4
14   Hannah   36         HR   77065               10         3
15    Ethan   24       Tech   72606               18         4
16    Diana   58         HR   51534               16         3
17   Hannah   28       Tech   80397                7         4
18   Hannah   42      Sales   41016                2         1
19  Charlie   30       Tech   95591                2         4


# 4Ô∏è‚É£ Use .apply to calculate a new column 'Seniority' where:
#     - If YearsExperience > 10 ‚Üí 'Senior'
#     - If between 5-10 ‚Üí 'Mid-Level'
#     - Else ‚Üí 'Junior'
#    - Use a lambda function with apply.

In [37]:
def func(x):
  if x>10:
    return 'Senior'
  elif x>5 and x<10:
    return 'Mid-level'
  else:
    return 'Junior'

df['Seniority']=df['YearsExperience'].apply(func)
print(df)

       Name  Age Department  Salary  YearsExperience  Seniority
0    George   43         HR   75920               15     Senior
1     Diana   23  Marketing  107121               12     Senior
2     Ethan   45       Tech  109479               17     Senior
3    George   51      Sales   59457               14     Senior
4   Charlie   59       Tech  106557               12     Senior
5    Hannah   23  Marketing  117189                8  Mid-level
6     Ethan   42  Marketing  118953               14     Senior
7     Ethan   54  Marketing   92995               12     Senior
8    George   33      Sales   35000                0     Junior
9       Bob   43  Marketing   49692                6  Mid-level
10  Charlie   46      Sales   85758                8  Mid-level
11   George   48  Marketing   35000                0     Junior
12  Charlie   49       Tech  111211               11     Senior
13  Charlie   37       Tech  105697                7  Mid-level
14   Hannah   36         HR   77065               10     Junior
15    Ethan   24       Tech   72606               18     Senior
16    Diana   58         HR   51534               16     Senior
17   Hannah   28       Tech   80397                7  Mid-level
18   Hannah   42      Sales   35000                2     Junior
19  Charlie   30       Tech   35000                2     Junior


# 5Ô∏è‚É£ Overwrite all salaries for employees with < 3 years of experience to 35000.
#    - Use boolean indexing with .loc to do this.

In [67]:
for i in range(20):
  if df.loc[i,'YearsExperience']<3:
    df.loc[i,'Salary']=35000
print(df)

       Name  Age Department  Salary  YearsExperience
0    George   43         HR   75920               15
1     Diana   23  Marketing  107121               12
2     Ethan   45       Tech  109479               17
3    George   51      Sales   59457               14
4   Charlie   59       Tech  106557               12
5    Hannah   23  Marketing  117189                8
6     Ethan   42  Marketing  118953               14
7     Ethan   54  Marketing   92995               12
8    George   33      Sales   35000                0
9       Bob   43  Marketing   49692                6
10  Charlie   46      Sales   85758                8
11   George   48  Marketing   35000                0
12  Charlie   49       Tech  111211               11
13  Charlie   37       Tech  105697                7
14   Hannah   36         HR   77065               10
15    Ethan   24       Tech   72606               18
16    Diana   58         HR   51534               16
17   Hannah   28       Tech   80397                7
18   Hannah   42      Sales   35000                2
19  Charlie   30       Tech   35000                2


# 6Ô∏è‚É£ Compare using .loc and .iloc to select the same row:
#    - Select the 3rd row using .iloc
#    - Find its index value and use .loc to select the same row by label

In [43]:
print(df.iloc[2])
print(df.loc[2])

Name                Ethan
Age                    45
Department           Tech
Salary             109479
YearsExperience        17
Seniority          Senior
Name: 2, dtype: object
Name                Ethan
Age                    45
Department           Tech
Salary             109479
YearsExperience        17
Seniority          Senior
Name: 2, dtype: object


# 7Ô∏è‚É£ Check if there are any duplicate names in the dataset.
#    - If there are, show only those duplicated rows.

In [91]:
print(df[df['Name'].map(df['Name'].value_counts())>1])

       Name  Age Department  Salary  YearsExperience
0    George   43         HR   75920               15
1     Diana   23  Marketing  107121               12
2     Ethan   45       Tech  109479               17
3    George   51      Sales   59457               14
4   Charlie   59       Tech  106557               12
5    Hannah   23  Marketing  117189                8
6     Ethan   42  Marketing  118953               14
7     Ethan   54  Marketing   92995               12
8    George   33      Sales   80757                0
10  Charlie   46      Sales   85758                8
11   George   48  Marketing  112409                0
12  Charlie   49       Tech  111211               11
13  Charlie   37       Tech  105697                7
14   Hannah   36         HR   77065               10
15    Ethan   24       Tech   72606               18
16    Diana   58         HR   51534               16
17   Hannah   28       Tech   80397                7
18   Hannah   42      Sales   41016                2
19  Charlie   30       Tech   95591                2


# 8Ô∏è‚É£ Sort the DataFrame by Salary in descending order.
#    - Then sort it by Department and within Department by Age.

In [75]:
print(df.sort_values(by='Salary',ascending=False))

       Name  Age Department  Salary  YearsExperience
6     Ethan   42  Marketing  118953               14
5    Hannah   23  Marketing  117189                8
11   George   48  Marketing  112409                0
12  Charlie   49       Tech  111211               11
2     Ethan   45       Tech  109479               17
1     Diana   23  Marketing  107121               12
4   Charlie   59       Tech  106557               12
13  Charlie   37       Tech  105697                7
19  Charlie   30       Tech   95591                2
7     Ethan   54  Marketing   92995               12
10  Charlie   46      Sales   85758                8
8    George   33      Sales   80757                0
17   Hannah   28       Tech   80397                7
14   Hannah   36         HR   77065               10
0    George   43         HR   75920               15
15    Ethan   24       Tech   72606               18
3    George   51      Sales   59457               14
16    Diana   58         HR   51534               16
9       Bob   43  Marketing   49692                6
18   Hannah   42      Sales   41016                2


# 9Ô∏è‚É£ Slice the DataFrame to return rows 5 through 12 and columns 'Name', 'Salary'
#    - Try slicing using both label-based and position-based methods.

In [84]:
print(df.loc[5:12,['Name','Salary']])
print(df.iloc[5:13,[0,3]])

       Name  Salary
5    Hannah  117189
6     Ethan  118953
7     Ethan   92995
8    George   80757
9       Bob   49692
10  Charlie   85758
11   George  112409
12  Charlie  111211
       Name  Salary
5    Hannah  117189
6     Ethan  118953
7     Ethan   92995
8    George   80757
9       Bob   49692
10  Charlie   85758
11   George  112409
12  Charlie  111211


# üîü Find all rows where the name starts with 'A' or 'D'.
#    - Use string methods with .str accessor.

In [88]:
print(df[df['Name'].str.startswith('A') | df['Name'].str.startswith('D')])

     Name  Age Department  Salary  YearsExperience
1   Diana   23  Marketing  107121               12
16  Diana   58         HR   51534               16


# 1Ô∏è‚É£1Ô∏è‚É£ Drop all rows where Age is below 25.
#     - Explain whether this modifies the DataFrame in place or returns a copy.

In [114]:
print(df.drop(df[df['Age']<25].index))

#it returns a copy not modify

       Name  Age Department  Salary  YearsExperience  DeptCode
0    George   43         HR   75920               15         3
2     Ethan   45       Tech  109479               17         4
3    George   51      Sales   59457               14         1
4   Charlie   59       Tech  106557               12         4
6     Ethan   42  Marketing  118953               14         2
7     Ethan   54  Marketing   92995               12         2
8    George   33      Sales   80757                0         1
9       Bob   43  Marketing   49692                6         2
10  Charlie   46      Sales   85758                8         1
11   George   48  Marketing  112409                0         2
12  Charlie   49       Tech  111211               11         4
13  Charlie   37       Tech  105697                7         4
14   Hannah   36         HR   77065               10         3
16    Diana   58         HR   51534               16         3
17   Hannah   28       Tech   80397                7         4
18   Hannah   42      Sales   41016                2         1
19  Charlie   30       Tech   95591                2         4


# 1Ô∏è‚É£2Ô∏è‚É£ Use groupby to calculate the average salary per Department.
#     - Bonus: Show the average age and average experience too.

In [108]:
print(df.groupby('Department')['Salary'].mean())
print(df.groupby('Department')['Age'].mean())
print(df.groupby('Department')['YearsExperience'].mean())

Department
HR           68173.000000
Marketing    99726.500000
Sales        66747.000000
Tech         97362.571429
Name: Salary, dtype: float64
Department
HR           45.666667
Marketing    38.833333
Sales        43.000000
Tech         38.857143
Name: Age, dtype: float64
Department
HR           13.666667
Marketing     8.666667
Sales         6.000000
Tech         10.571429
Name: YearsExperience, dtype: float64


# 1Ô∏è‚É£3Ô∏è‚É£ Use groupby to count how many employees are in each Department.

In [111]:
print(df.groupby('Department')['Name'].count())

Department
HR           3
Marketing    6
Sales        4
Tech         7
Name: Name, dtype: int64


# 1Ô∏è‚É£4Ô∏è‚É£ Use .apply to normalize the Salary column (min-max scaling between 0 and 1).
#     - Bonus: Write your own normalization function and pass it to apply.

In [127]:
def func(x):
  return ((x-df['Salary'].min())/(df['Salary'].max()-df['Salary'].min()))

df['New Salary']=df['Salary'].apply(func)
print(df)

       Name  Age Department  Salary  YearsExperience  DeptCode  New Salary
0    George   43         HR   75920               15         3    0.447849
1     Diana   23  Marketing  107121               12         2    0.848185
2     Ethan   45       Tech  109479               17         4    0.878440
3    George   51      Sales   59457               14         1    0.236614
4   Charlie   59       Tech  106557               12         4    0.840948
5    Hannah   23  Marketing  117189                8         2    0.977366
6     Ethan   42  Marketing  118953               14         2    1.000000
7     Ethan   54  Marketing   92995               12         2    0.666936
8    George   33      Sales   80757                0         1    0.509912
9       Bob   43  Marketing   49692                6         2    0.111321
10  Charlie   46      Sales   85758                8         1    0.574079
11   George   48  Marketing  112409                0         2    0.916035
12  Charlie   49       Tech  111211               11         4    0.900663
13  Charlie   37       Tech  105697                7         4    0.829914
14   Hannah   36         HR   77065               10         3    0.462540
15    Ethan   24       Tech   72606               18         4    0.405327
16    Diana   58         HR   51534               16         3    0.134955
17   Hannah   28       Tech   80397                7         4    0.505293
18   Hannah   42      Sales   41016                2         1    0.000000
19  Charlie   30       Tech   95591                2         4    0.700245


# 1Ô∏è‚É£5Ô∏è‚É£ Use boolean indexing to find all employees who:
#     - Are in 'HR' OR 'Tech', AND have > 5 years of experience.

# üîÅ For many of these tasks, try both .loc and .iloc to build intuition on their differences.

In [137]:
print(df.loc[(df['Department']=='HR')|(df['Department']=='Tech') & (df['YearsExperience']>5)])

       Name  Age Department  Salary  YearsExperience
0    George   43         HR   75920               15
2     Ethan   45       Tech  109479               17
4   Charlie   59       Tech  106557               12
12  Charlie   49       Tech  111211               11
13  Charlie   37       Tech  105697                7
14   Hannah   36         HR   77065               10
15    Ethan   24       Tech   72606               18
16    Diana   58         HR   51534               16
17   Hannah   28       Tech   80397                7